{
    "who are you": "I am Krishna's Virtual AI Assistant. I am here to help you explore his Portfolio",
    "tell me about krishna": "Krishna Verma is a Computer Science undergraduate at SCET, Ghaziabad. He embodies the 'Lazy Coder' philosophy: 'If a task needs to be done twice, automate it.' He focuses on building scalable backends with PostgreSQL and Python, and interactive frontends using Flask. Beyond code, he enjoys Chess (strategic planning) and Open Source contribution.",
    "what are his top technical skills": "Krishna specializes in Backend Development and Automation. His core stack includes:\n\n* **Python & Flask:** His primary tools for building scalable APIs and automation scripts.\n* **PostgreSQL:** His choice for relational database management and data integrity.\n* **JavaScript (ES6+):** Used for asynchronous frontend interactions and dynamic UI logic.\n* **C/C++:** The foundation of his understanding of memory management and algorithms.\n* **Git & GitHub:** Essential for his version control, CI/CD pipelines, and Open Source work.",
    "tell me about his projects": "Krishna has developed several full-stack and logic-based projects. Here are his top featured works:\n\n* **[Live Weather Dashboard](https://github.com/krissshnaverrrma/Weather-APP):** A real-time weather app featuring geolocation, 5-day forecasting, and dynamic background themes.\n* **[Quote Studio AI](https://github.com/krissshnaverrrma/Qoute-Studio-AI):** A full-stack web app that uses AI to generate mood-based quotes, allowing users to export them as aesthetic images.\n* **[Python ATM Simulation](https://github.com/krissshnaverrrma):** A console-based banking system demonstrating complex OOP principles, PIN security, and transaction state management.\n* **[2D Table Tennis](https://github.com/krissshnaverrrma/Table-Tennis):** A retro-style Ping Pong game implementing AABB collision detection and vector physics.\n* **[Dual Clock](https://github.com/krissshnaverrrma/Dual-Clock):** A GUI application displaying synchronized Analog and Digital time formats using Python's Tkinter.",
    "show me his blog posts": "Krishna documents his learning journey through technical blogs. Some highlights include:\n\n* **Automating Academics:** How he used C file handling to automate GPA calculations.\n* **Physics in a Loop:** A deep dive into the vector math behind his 2D Table Tennis game.\n* **Fetching the Sky:** A tutorial on consuming REST APIs for his Weather Dashboard.\n* **Quote Studio (AI):** Integrating Generative AI models into a Flask web application.",
    "what certifications has he earned": "Krishna is constantly Up Skilling. His recent certifications include:\n\n* **Microsoft & Google Productivity Tools** by Udemy (2026)\n* **Artificial Intelligence Masterclass** by Udemy (2026)\n* **Python ATM Simulation** by Let'sUpgrade\n* **Git - Github Bootcamp** by Let'sUpgrade\n* **Scientific Computing with Python** by freeCodeCamp\n* **Responsive Web Design** by freeCodeCamp",
    "does he have experience with Python?": "Yes, Python is a foundational skill for Krishna and central to his work.\n\nHe utilizes Python for:\n*   **Rapid scripting and automation:** Perfectly aligning with his 'Lazy Coder' philosophy of automating tasks that need to be done more than once.\n*   **Building complex, scalable backend systems:** He frequently uses frameworks like Flask for this purpose.\n*   Its readability allows him to concentrate on developing efficient logic and robust architecture.\n\nHis proficiency is demonstrated in projects such as 'Qoute-Studio-AI' and 'My-Portfolio', which are both built using Python with Flask.",
    "how can i contact him": "You can reach Krishna via the following channels:\n\n* **Email:** krishnav24-cs@sanskar.org\n* **GitHub:** [krissshnaverrrma](https://github.com/krissshnaverrrma)\n* **LinkedIn:** [krishnav-cs](https://linkedin.com/in/krishnav-cs)"
}